[
  {
    "id": 1,
    "title": "5 Tips for Baking the Perfect Pie Crust",
    "content": "Baking a flaky and delicious pie crust can seem daunting, but with these simple tips, you'll be a pie-making pro in no time! 1. Use cold ingredients... (read more)",
    "author": "John Doe",
    "category": "Cooking",
    "created_at": "2024-03-04T10:00:00Z",
    "comments": []
  },
  {
    "id": 2,
    "title": "Must-Have Travel Apps for Your Next Adventure",
    "content": "Planning a trip? Don't forget to download these essential travel apps to make your journey smooth and enjoyable. From finding the best flights and accommodation... (read more)",
    "author": "Jane Smith",
    "category": "Travel",
    "created_at": "2024-03-03T15:30:00Z",
    "comments": []
  },
  {
    "id": 3,
    "title": "The Benefits of Reading: Why You Should Pick Up a Book Today",
    "content": "In today's fast-paced world, it's easy to neglect the simple pleasure of reading. But did you know that reading offers a wealth of benefits for your mind, body, and soul?... (read more)",
    "author": "Alice Jones",
    "category": "Lifestyle",
    "created_at": "2024-03-02T12:00:00Z",
    "comments": []
  },
  {
    "id": 4,
    "title": "Top 5 Sustainable Fashion Brands to Know",
    "content": "Making conscious choices about the clothes we wear is becoming increasingly important. Here are 5 sustainable fashion brands that prioritize ethical production and eco-friendly materials... (read more)",
    "author": "David Lee",
    "category": "Fashion",
    "created_at": "2024-03-01T18:00:00Z",
    "comments": []
  },
  {
    "id": 5,
    "title": "Home Office Hacks: Tips for Staying Productive and Organized",
    "content": "Working from home can be a dream come true for many, but it also comes with its own set of challenges. Here are some tips to help you stay productive and organized in your home office... (read more)",
    "author": "Emily Brown",
    "category": "Productivity",
    "created_at": "2024-02-29T14:00:00Z",
    "comments": []
  },
  {
    "id": 6,
    "title": "The Power of Meditation: How to Find Inner Peace and Reduce Stress",
    "content": "Meditation is a practice that has been around for centuries, and for good reason. It has been shown to reduce stress, improve focus, and promote overall well-being... (read more)",
    "author": "Michael White",
    "category": "Wellness",
    "created_at": "2024-02-28T10:30:00Z",
    "comments": []
  },
  {
    "id": 7,
    "title": "Must-See Historical Sites Around the World",
    "content": "History buffs rejoice! This list highlights some of the most fascinating and awe-inspiring historical sites around the world, from the Great Wall of China to the Colosseum in Rome... (read more)",
    "author": "Sarah Jackson",
    "category": "History",
    "created_at": "2024-02-27T17:00:00Z",
    "comments": []
  },
  {
    "id": 8,
    "title": "The Science of Sleep: Why Getting Enough Rest is Crucial",
    "content": "Sleep is not a luxury, it's a necessity. During sleep, our bodies and minds go through essential restorative processes. But how much sleep do we actually need, and what happens... (read more)",
    "author": "William Miller",
    "category": "Health",
    "created_at": "2024-02-26T13:00:00Z",
    "comments":[]
  }
]
